In [54]:
import pandas as pd

In [55]:
pd.__version__

'2.2.2'

In [56]:
pip install --upgrade pandas --user

Requirement already satisfied: pandas in c:\users\sn112\anaconda3\envs\elmuki\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.23.2 in c:\users\sn112\anaconda3\envs\elmuki\lib\site-packages (from pandas) (1.26.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\sn112\anaconda3\envs\elmuki\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\sn112\anaconda3\envs\elmuki\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\sn112\anaconda3\envs\elmuki\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\sn112\anaconda3\envs\elmuki\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [57]:
s1=pd.Series([1,2,3,4,'five'],index=['a','b','c','d','e'])

In [58]:
print(s1)

a       1
b       2
c       3
d       4
e    five
dtype: object

In [59]:
s2=pd.Series(["python","Html","Devops","R","java"],index=[1,2,3,4,5])

In [60]:
print(s2)

1    python
2      Html
3    Devops
4         R
5      java
dtype: object

# DATA FRAME

DETAIL=pd.DataFrame(data,column=[column name ])

In [61]:
df1=pd.DataFrame(s2,columns=["langauges"])

In [62]:
(df1)

  langauges
1    python
2      Html
3    Devops
4         R
5      java

In [63]:
Fruits={"seed":{1:"orange",2:"apple",3:"watermelon"},"seedless":{1:"pineapple",2:"grapes",3:"pappaya"}}

In [64]:
df2=pd.DataFrame(Fruits,columns=["seed","seedless"])

In [65]:
df2

         seed   seedless
1      orange  pineapple
2       apple     grapes
3  watermelon    pappaya

# Activity1

create a dataframe for your class,containing "name","reg no","year of study" as column names for 5students

In [66]:
Class={"Name":{1:"devi",2:"afreen",3:"dharsh",4:"keerthu",5:"mamas"},"Reg no":{1:1,2:9,3:8,4:6,5:5},"year of study":{1:"first",2:"second",3:"third",4:"fourth",5:"six"}}

In [67]:
df3=pd.DataFrame(Class,columns=["Name","Reg no","year of study"])

In [68]:
df3

      Name  Reg no year of study
1     devi       1         first
2   afreen       9        second
3   dharsh       8         third
4  keerthu       6        fourth
5    mamas       5           six

In [73]:
student=df3["Name"]

In [75]:
df3.drop("Name",axis=1)

   Reg no year of study
1       1         first
2       9        second
3       8         third
4       6        fourth
5       5           six